tutorials/flowOverThickPlate/flowOverThickPlate_5deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        nFaces          40;
        startFace       3120;
    }
    inlet
    {
        type            wall;
        nFaces          40;
        startFace       3160;
    }
    outlet
    {
        type            wall;
        nFaces          40;
        startFace       3200;
    }
    bottom
    {
        type            wall;
        nFaces          40;
        startFace       3240;
    }
    frontAndBack
    {
        type            empty;
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
